In [1]:
import pandas as pd

In [2]:
import numpy as np

In [47]:
df = pd.read_excel('titanic.xlsx')

In [ ]:
round(df['Age'].mean(), 1)

29.7

In [11]:
df['Pclass'].head(5)

0    3
1    1
2    3
3    1
4    3
Name: Pclass, dtype: int64

In [49]:
df['Embarked'].isnull().sum()

2

In [44]:
df['Embarked'] = df['Embarked'].fillna('S')

In [18]:
df[df['Pclass'] == 1]['Pclass'].sum()

216

In [48]:
df[df['Embarked'] == 'S'].count()

PassengerId    644
Survived       644
Pclass         644
Name           644
Sex            644
Age            554
SibSp          644
Parch          644
Ticket         644
Fare           644
Cabin          129
Embarked       644
dtype: int64

In [52]:
df.groupby(['Pclass', 'Sex'])['Age'].mean()

Pclass  Sex
1       female    34.611765
        male      41.281386
2       female    28.722973
        male      30.740707
3       female    21.750000
        male      26.507589
Name: Age, dtype: float64

In [38]:
df.isnull().sum().values.sum()

866

In [40]:
most_freq

0    S
Name: Embarked, dtype: object

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [23]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [24]:
df.isna().sum(axis = 0)

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [25]:
df.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [26]:
df['Age'].describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

In [32]:
df['AgeFilled'] = df.fillna({"Age" : df['Age'].mean()})['Age']

In [35]:
df.isna().sum(axis = 0)

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
AgeFilled        0
dtype: int64

In [36]:
df['IsAdult'] = df['Age'] > 18

In [37]:
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,AgeFilled,IsAdult
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,22.0,True
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,38.0,True
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,26.0,True
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,35.0,True
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,35.0,True

In [40]:
df2 = df.groupby('Sex').agg({
    'Age' : 'mean',
    'PassengerId' : 'count',
    'Survived' : 'sum'
})

In [41]:
df2

              Age  PassengerId  Survived
Sex
female  28.216730          314       233
male    30.505824          577       109

In [42]:
df2['CoeffSurv'] = df2['Survived'] / df2['PassengerId']

In [43]:
df2

              Age  PassengerId  Survived  CoeffSurv
Sex
female  28.216730          314       233   0.742038
male    30.505824          577       109   0.188908

In [47]:
df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,AgeFilled,IsAdult
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,22.0,True
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,38.0,True

In [49]:
df.sort_values('Fare', ascending = True)[['Name', 'Pclass', 'Fare']].head(5)

                                Name  Pclass  Fare
271     Tornquist, Mr. William Henry       3   0.0
597              Johnson, Mr. Alfred       3   0.0
302  Johnson, Mr. William Cahoone Jr       3   0.0
633    Parr, Mr. William Henry Marsh       1   0.0
277      Parkes, Mr. Francis "Frank"       2   0.0

In [51]:
df2.drop(columns = ['Age'])

        PassengerId  Survived  CoeffSurv
Sex
female          314       233   0.742038
male            577       109   0.188908